import { ALLIANCE } from '../constants'

export const positions = {
    [ALLIANCE.RED]: {
        '未爬': { top: '42%', left: '10%' },
        '左爬': { top: '42%', left: '22%' },
        '中爬': { top: '50%', left: '22%' },
        '右爬': { top: '58%', left: '22%' },

        '成功': { top: '50%', left: '10%' },
        '失败': { top: '58%', left: '10%' },

        '首吸中场': { top: '18%', left: '74%' },
        '首吸DEPOT': { top: '26%', left: '21%' },
        '首吸OUTPOST': { top: '84%', left: '16%' },
        '无首吸': { top: '88%', left: '28%' },

        '回程：洞上': { top: '10%', left: '42%' },
        '回程：洞下': { top: '85%', left: '42%' },
        '回程：坡上': { top: '30%', left: '42%' },
        '回程：坡下': { top: '65%', left: '42%' },

        '中切': { top: '47%', left: '61%' },
        '球阵角': { top: '70%', left: '61%' },
        '边切': { top: '76%', left: '73%' },

        '撞车': { top: '47%', left: '88%' },

        '计时器': { top: '8%', left: '3%' },

        '自动结束': { top: '1%', left: '3%' },
    },
    [ALLIANCE.BLUE]: {
        '未爬': { top: '35%', left: '82%' },
        '左爬': { top: '51%', left: '70%' },
        '中爬': { top: '43%', left: '70%' },
        '右爬': { top: '35%', left: '70%' },

        '成功': { top: '51%', left: '82%' },
        '失败': { top: '43%', left: '82%' },

        '首吸中场': { top: '18%', left: '16%' },
        '首吸DEPOT': { top: '68%', left: '70%' },
        '首吸OUTPOST': { top: '10%', left: '75%' },
        '无首吸': { top: '8%', left: '60%' },

        '回程：洞上': { top: '10%', left: '42%' },
        '回程：洞下': { top: '85%', left: '42%' },
        '回程：坡上': { top: '30%', left: '42%' },
        '回程：坡下': { top: '65%', left: '42%' },

        '中切': { top: '47%', left: '28%' },
        '球阵角': { top: '70%', left: '28%' },
        '边切': { top: '76%', left: '17%' },

        '撞车': { top: '47%', left: '3%' },

        '计时器': { top: '8%', left: '3%' },

        '自动结束': { top: '1%', left: '3%' },
    }
}
